Tekla Open API Reference for Tekla Structures 2025
AnalysisSubSection.H2 Property
 The H2 value.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double H2 { get; set; }
Public Property H2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisSubSection Class
Tekla.Structures.Analysis Namespace